content/posts/hello-world.md
+++
title = "Creativity, Decisions, and the Beginning"
date = 2025-10-07
lastmod = 2025-10-10T11:32:18+07:00
tags = ["paranesia", "devlog"]
draft = false
author = "Billy Zaelani Malik"
+++

## Creativity {#creativity}

I recently read an [article](https://www.fredrikharen.com/the-creative-process-decisions-at-the-core-episode-141/) by Fredrik Haren, where he interviewed Alice Liu, who
shared a perspective that completely reframed how I think about creativity:

> Creativity is 99% decisions and 1% inspiration — Alice Liu

For so long, I thought creativity was something abstract — a kind of mysterious
spark that visits you when it wants to. But when Liu said that creativity is
about making decisions, I realized maybe it was never about waiting at all.
Maybe it was about moving, one choice at a time.


## Decisions {#decisions}

Liu also described a simple yet powerful framework for becoming more creative by
improving how we make decisions:

1.  **Practice decision-making deliberately** — the more decisions you make, the more
    your brain refines its prediction models.
2.  **Desensitize yourself to fear** — confront the fear of failure, and mistakes
    become data to learn from.
3.  **Optimize your path to decisions** — keep moving forward in the creative process
    without getting trapped in indecision or overthinking.

That last part struck me the most because it connects with how I’ve been
thinking about **constraints** lately. I used to believe that constraints limit
creativity, but now I see them as what make creativity possible. When I only
have eleven options instead of one hundred, the decision feels manageable.
Constraints give clarity — they optimize the path to decisions.

Even game jams use this principle intentionally. Their themes are constraints.
They focus the chaos into direction.


## The Beginning of My Journey {#the-beginning-of-my-journey}

In the end, creativity always comes back to decisions and the constraints that
shape them. Limits aren’t barriers — they’re guides. They narrow the path just
enough for us to see where to step next. Starting an indie game studio was one
of those defining choices.

Coming from a love of watching stand-up comedy that tackles sensitive topics —
what we call _materi pinggir jurang_ — and a lifelong fascination with games, I’m
starting a small indie game studio called **Pinggir Jurang Studio**. We make games
that invite players to stand on the edge and see the world from a different
perspective. Our first game is **Paranesia** — a satirical, mutiplayer deck-building
game about running a political campaign.

This is where the journey begins — at the edge, where Pinggir Jurang Studio
takes its first step and Paranesia starts to take shape. There’s no clear map
ahead, only the decisions that will carve the path forward.
